const metaData = {
  SheetOne: {
    title: 'J01 收入决算表(财决03表)',
    startRowIndex: 7,
    order: 'asc',
    orderBy: 'A'
  },
  SheetTwo: {
    title: 'J02 收入支出决算表(财决02表)',
    startRowIndex: 7,
    order: 'asc',
    orderBy: 'extends.row',
    countConfig: {
      E: ['F', 'G', 'H'],
      I: ['I'],
      J: ['J'],
      K: ['L', 'M', 'N'],
      O: ['O'],
      P: ['Q', 'R', 'S', 'T'],
      U: ['V', 'W', 'X']
    }
  },
  SheetThree: {
    title: 'J03 一般公共预算财政拨款项目收入支出明细表',
    startRowIndex: 7,
    order: 'asc',
    orderBy: 'A',
    countConfig: {
      E: ['E'],
      F: ['F'],
      G: ['G'],
      I: ['J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V'],
      W: ['X', 'Y', 'Z', 'AA', 'AB', 'AC', 'AD', 'AE', 'AF', 'AG', 'AH', 'AI', 'AJ', 'AK', 'AL', 'AM', 'AN', 'AO', 'AP', 'AQ', 'AR', 'AS', 'AT', 'AU', 'AV', 'AW', 'AX'],
      AY: ['AZ', 'BA', 'BB', 'BC', 'BD', 'BE', 'BF', 'BG', 'BH', 'BI', 'BJ'],
      BK: ['BL', 'BM', 'BN', 'BO'],
      BP: ['BQ', 'BR', 'BS', 'BT', 'BU', 'BV', 'BW', 'BX', 'BY', 'BZ', 'CA', 'CB'],
      CC: ['CD', 'CE', 'CF', 'CG', 'CH', 'CI', 'CJ', 'CK', 'CL', 'CM', 'CN', 'CO', 'CP', 'CQ', 'CR', 'CS'],
      CT: ['CU', 'CV'],
      CW: ['CX', 'CY', 'CZ', 'DA', 'DB'],
      DC: ['DD', 'DE'],
      DF: ['DG', 'DH', 'DI', 'DJ'],
      H: ['I', 'W', 'AY', 'BK', 'BP', 'CC', 'CT', 'CW', 'DC', 'DF']
    }
  },
  SheetFour: {
    title: 'J04 项目收入支出明细表',
    startRowIndex: 7,
    order: 'asc',
    orderBy: 'A',
    countConfig: {
      E: ['E'],
      F: ['F'],
      G: ['G'],
      I: ['J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V'],
      W: ['X', 'Y', 'Z', 'AA', 'AB', 'AC', 'AD', 'AE', 'AF', 'AG', 'AH', 'AI', 'AJ', 'AK', 'AL', 'AM', 'AN', 'AO', 'AP', 'AQ', 'AR', 'AS', 'AT', 'AU', 'AV', 'AW', 'AX'],
      AY: ['AZ', 'BA', 'BB', 'BC', 'BD', 'BE', 'BF', 'BG', 'BH', 'BI', 'BJ'],
      BK: ['BL', 'BM', 'BN', 'BO'],
      BP: ['BQ', 'BR', 'BS', 'BT', 'BU', 'BV', 'BW', 'BX', 'BY', 'BZ', 'CA', 'CB'],
      CC: ['CD', 'CE', 'CF', 'CG', 'CH', 'CI', 'CJ', 'CK', 'CL', 'CM', 'CN', 'CO', 'CP', 'CQ', 'CR', 'CS'],
      CT: ['CU', 'CV'],
      CW: ['CX', 'CY', 'CZ', 'DA', 'DB'],
      DC: ['DD', 'DE'],
      DF: ['DG', 'DH', 'DI', 'DJ'],
      H: ['I', 'W', 'AY', 'BK', 'BP', 'CC', 'CT', 'CW', 'DC', 'DF']
    }
  },
  SheetFive: {
    title: 'J05 经济分类余额表',
    startRowIndex: 4,
    countConfig: {
      C: ['C'],
      D: ['D'],
      E: ['E'],
      F: ['F'],
      G: ['G'],
      H: ['H'],
      I: ['I']
    },
    mappingData: {
      '301': 'I',
      '302': 'W',
      '303': 'AY',
      '307': 'BK',
      '309': 'BP',
      '310': 'CC',
      '311': 'CT',
      '312': 'CW',
      '313': 'DC',
      '399': 'DF',
      '30101': 'J',
      '30102': 'K',
      '30103': 'L',
      '30106': 'M',
      '30107': 'N',
      '30108': 'O',
      '30109': 'P',
      '30110': 'Q',
      '30111': 'R',
      '30112': 'S',
      '30113': 'T',
      '30114': 'U',
      '30199': 'V',
      '30201': 'X',
      '30202': 'Y',
      '30203': 'Z',
      '30204': 'AA',
      '30205': 'AB',
      '30206': 'AC',
      '30207': 'AD',
      '30208': 'AE',
      '30209': 'AF',
      '30211': 'AG',
      '30212': 'AH',
      '30213': 'AI',
      '30214': 'AJ',
      '30215': 'AK',
      '30216': 'AL',
      '30217': 'AM',
      '30218': 'AN',
      '30224': 'AO',
      '30225': 'AP',
      '30226': 'AQ',
      '30227': 'AR',
      '30228': 'AS',
      '30229': 'AT',
      '30231': 'AU',
      '30239': 'AV',
      '30240': 'AW',
      '30299': 'AX',
      '30301': 'AZ',
      '30302': 'BA',
      '30303': 'BB',
      '30304': 'BC',
      '30305': 'BD',
      '30306': 'BE',
      '30307': 'BF',
      '30308': 'BG',
      '30309': 'BH',
      '30310': 'BI',
      '30399': 'BJ',
      '30701': 'BL',
      '30702': 'BM',
      '30703': 'BN',
      '30704': 'BO',
      '30901': 'BQ',
      '30902': 'BR',
      '30903': 'BS',
      '30905': 'BT',
      '30906': 'BU',
      '30907': 'BV',
      '30908': 'BW',
      '30913': 'BX',
      '30919': 'BY',
      '30921': 'BZ',
      '30922': 'CA',
      '30999': 'CB',
      '31001': 'CD',
      '31002': 'CE',
      '31003': 'CF',
      '31005': 'CG',
      '31006': 'CH',
      '31007': 'CI',
      '31008': 'CJ',
      '31009': 'CK',
      '31010': 'CL',
      '31011': 'CM',
      '31012': 'CN',
      '31013': 'CO',
      '31019': 'CP',
      '31021': 'CQ',
      '31022': 'CR',
      '31099': 'CS',
      '31101': 'CU',
      '31199': 'CV',
      '31201': 'CX',
      '31203': 'CY',
      '31204': 'CZ',
      '31205': 'DA',
      '31299': 'DB',
      '31302': 'DD',
      '31303': 'DE',
      '39906': 'DG',
      '39907': 'DH',
      '39908': 'DI',
      '39999': 'DJ'
    },
    initData: [
      {
        'A': '301',
        'B': '工资福利支出',
        'extends': {
          'row': 4
        }
      },
      {
        'A': '30101',
        'B': '基本工资',
        'extends': {
          'row': 5
        }
      },
      {
        'A': '30102',
        'B': '津贴补贴',
        'extends': {
          'row': 6
        }
      },
      {
        'A': '30103',
        'B': '奖金',
        'extends': {
          'row': 7
        }
      },
      {
        'A': '30106',
        'B': '伙食补助费',
        'extends': {
          'row': 8
        }
      },
      {
        'A': '30107',
        'B': '绩效工资',
        'extends': {
          'row': 9
        }
      },
      {
        'A': '30108',
        'B': '机关事业单位基本养老保险缴费',
        'extends': {
          'row': 10
        }
      },
      {
        'A': '30109',
        'B': '职业年金缴费',
        'extends': {
          'row': 11
        }
      },
      {
        'A': '30110',
        'B': '职工基本医疗保险缴费',
        'extends': {
          'row': 12
        }
      },
      {
        'A': '30111',
        'B': '公务员医疗补助缴费',
        'extends': {
          'row': 13
        }
      },
      {
        'A': '30112',
        'B': '其他社会保障缴费',
        'extends': {
          'row': 14
        }
      },
      {
        'A': '30113',
        'B': '住房公积金',
        'extends': {
          'row': 15
        }
      },
      {
        'A': '30114',
        'B': '医疗费',
        'extends': {
          'row': 16
        }
      },
      {
        'A': '30199',
        'B': '其他工资福利支出',
        'extends': {
          'row': 17
        }
      },
      {
        'A': '302',
        'B': '商品和服务支出',
        'extends': {
          'row': 18
        }
      },
      {
        'A': '30201',
        'B': '办公费',
        'extends': {
          'row': 19
        }
      },
      {
        'A': '30202',
        'B': '印刷费',
        'extends': {
          'row': 20
        }
      },
      {
        'A': '30203',
        'B': '咨询费',
        'extends': {
          'row': 21
        }
      },
      {
        'A': '30204',
        'B': '手续费',
        'extends': {
          'row': 22
        }
      },
      {
        'A': '30205',
        'B': '水费',
        'extends': {
          'row': 23
        }
      },
      {
        'A': '30206',
        'B': '电费',
        'extends': {
          'row': 24
        }
      },
      {
        'A': '30207',
        'B': '邮电费',
        'extends': {
          'row': 25
        }
      },
      {
        'A': '30208',
        'B': '取暖费',
        'extends': {
          'row': 26
        }
      },
      {
        'A': '30209',
        'B': '物业管理费',
        'extends': {
          'row': 27
        }
      },
      {
        'A': '30211',
        'B': '差旅费',
        'extends': {
          'row': 28
        }
      },
      {
        'A': '30212',
        'B': '因公出国（境）费用',
        'extends': {
          'row': 29
        }
      },
      {
        'A': '30213',
        'B': '维修（护）费',
        'extends': {
          'row': 30
        }
      },
      {
        'A': '30214',
        'B': '租赁费',
        'extends': {
          'row': 31
        }
      },
      {
        'A': '30215',
        'B': '会议费',
        'extends': {
          'row': 32
        }
      },
      {
        'A': '30216',
        'B': '培训费',
        'extends': {
          'row': 33
        }
      },
      {
        'A': '30217',
        'B': '公务接待费',
        'extends': {
          'row': 34
        }
      },
      {
        'A': '30218',
        'B': '专用材料费',
        'extends': {
          'row': 35
        }
      },
      {
        'A': '30224',
        'B': '被装购置费',
        'extends': {
          'row': 36
        }
      },
      {
        'A': '30225',
        'B': '专用燃料费',
        'extends': {
          'row': 37
        }
      },
      {
        'A': '30226',
        'B': '劳务费',
        'extends': {
          'row': 38
        }
      },
      {
        'A': '30227',
        'B': '委托业务费',
        'extends': {
          'row': 39
        }
      },
      {
        'A': '30228',
        'B': '工会经费',
        'extends': {
          'row': 40
        }
      },
      {
        'A': '30229',
        'B': '福利费',
        'extends': {
          'row': 41
        }
      },
      {
        'A': '30231',
        'B': '公务用车运行维护费',
        'extends': {
          'row': 42
        }
      },
      {
        'A': '30239',
        'B': '其他交通费用',
        'extends': {
          'row': 43
        }
      },
      {
        'A': '30240',
        'B': '税金及附加费用',
        'extends': {
          'row': 44
        }
      },
      {
        'A': '30299',
        'B': '其他商品和服务支出',
        'extends': {
          'row': 45
        }
      },
      {
        'A': '303',
        'B': '对个人和家庭的补助',
        'extends': {
          'row': 46
        }
      },
      {
        'A': '30301',
        'B': '离休费',
        'extends': {
          'row': 47
        }
      },
      {
        'A': '30302',
        'B': '退休费',
        'extends': {
          'row': 48
        }
      },
      {
        'A': '30303',
        'B': '退职（役）费',
        'extends': {
          'row': 49
        }
      },
      {
        'A': '30304',
        'B': '抚恤金',
        'extends': {
          'row': 50
        }
      },
      {
        'A': '30305',
        'B': '生活补助',
        'extends': {
          'row': 51
        }
      },
      {
        'A': '30306',
        'B': '救济费',
        'extends': {
          'row': 52
        }
      },
      {
        'A': '30307',
        'B': '医疗费补助',
        'extends': {
          'row': 53
        }
      },
      {
        'A': '30308',
        'B': '助学金',
        'extends': {
          'row': 54
        }
      },
      {
        'A': '30309',
        'B': '奖励金',
        'extends': {
          'row': 55
        }
      },
      {
        'A': '30310',
        'B': '个人农业生产补贴',
        'extends': {
          'row': 56
        }
      },
      {
        'A': '30399',
        'B': '其他对个人和家庭的补助支出',
        'extends': {
          'row': 57
        }
      },
      {
        'A': '307',
        'B': '债务利息及费用支出',
        'extends': {
          'row': 58
        }
      },
      {
        'A': '30701',
        'B': '国内债务付息',
        'extends': {
          'row': 59
        }
      },
      {
        'A': '30702',
        'B': '国外债务付息',
        'extends': {
          'row': 60
        }
      },
      {
        'A': '30703',
        'B': '国内债务发行费用',
        'extends': {
          'row': 61
        }
      },
      {
        'A': '30704',
        'B': '国外债务发行费用',
        'extends': {
          'row': 62
        }
      },
      {
        'A': '309',
        'B': '资本性支出（基本建设）',
        'extends': {
          'row': 63
        }
      },
      {
        'A': '30901',
        'B': '房屋建筑物购建',
        'extends': {
          'row': 64
        }
      },
      {
        'A': '30902',
        'B': '办公设备购置',
        'extends': {
          'row': 65
        }
      },
      {
        'A': '30903',
        'B': '专用设备购置',
        'extends': {
          'row': 66
        }
      },
      {
        'A': '30905',
        'B': '基础设施建设',
        'extends': {
          'row': 67
        }
      },
      {
        'A': '30906',
        'B': '大型修缮',
        'extends': {
          'row': 68
        }
      },
      {
        'A': '30907',
        'B': '信息网络及软件购置更新',
        'extends': {
          'row': 69
        }
      },
      {
        'A': '30908',
        'B': '物资储备',
        'extends': {
          'row': 70
        }
      },
      {
        'A': '30913',
        'B': '公务用车购置',
        'extends': {
          'row': 71
        }
      },
      {
        'A': '30919',
        'B': '其他交通工具购置',
        'extends': {
          'row': 72
        }
      },
      {
        'A': '30921',
        'B': '文物和陈列品购置',
        'extends': {
          'row': 73
        }
      },
      {
        'A': '30922',
        'B': '无形资产购置',
        'extends': {
          'row': 74
        }
      },
      {
        'A': '30999',
        'B': '其他基本建设支出',
        'extends': {
          'row': 75
        }
      },
      {
        'A': '310',
        'B': '资本性支出',
        'extends': {
          'row': 76
        }
      },
      {
        'A': '31001',
        'B': '房屋建筑物购建',
        'extends': {
          'row': 77
        }
      },
      {
        'A': '31002',
        'B': '办公设备购置',
        'extends': {
          'row': 78
        }
      },
      {
        'A': '31003',
        'B': '专用设备购置',
        'extends': {
          'row': 79
        }
      },
      {
        'A': '31005',
        'B': '基础设施建设',
        'extends': {
          'row': 80
        }
      },
      {
        'A': '31006',
        'B': '大型修缮',
        'extends': {
          'row': 81
        }
      },
      {
        'A': '31007',
        'B': '信息网络及软件购置更新',
        'extends': {
          'row': 82
        }
      },
      {
        'A': '31008',
        'B': '物资储备',
        'extends': {
          'row': 83
        }
      },
      {
        'A': '31009',
        'B': '土地补偿',
        'extends': {
          'row': 84
        }
      },
      {
        'A': '31010',
        'B': '安置补助',
        'extends': {
          'row': 85
        }
      },
      {
        'A': '31011',
        'B': '地上附着物和青苗补偿',
        'extends': {
          'row': 86
        }
      },
      {
        'A': '31012',
        'B': '拆迁补偿',
        'extends': {
          'row': 87
        }
      },
      {
        'A': '31013',
        'B': '公务用车购置',
        'extends': {
          'row': 88
        }
      },
      {
        'A': '31019',
        'B': '其他交通工具购置',
        'extends': {
          'row': 89
        }
      },
      {
        'A': '31021',
        'B': '文物和陈列品购置',
        'extends': {
          'row': 90
        }
      },
      {
        'A': '31022',
        'B': '无形资产购置',
        'extends': {
          'row': 91
        }
      },
      {
        'A': '31099',
        'B': '其他资本性支出',
        'extends': {
          'row': 92
        }
      },
      {
        'A': '311',
        'B': '对企业补助（基本建设）',
        'extends': {
          'row': 93
        }
      },
      {
        'A': '31101',
        'B': '资本金注入',
        'extends': {
          'row': 94
        }
      },
      {
        'A': '31199',
        'B': '其他对企业补助',
        'extends': {
          'row': 95
        }
      },
      {
        'A': '312',
        'B': '对企业补助',
        'extends': {
          'row': 96
        }
      },
      {
        'A': '31201',
        'B': '资本金注入',
        'extends': {
          'row': 97
        }
      },
      {
        'A': '31203',
        'B': '政府投资基金股权投资',
        'extends': {
          'row': 98
        }
      },
      {
        'A': '31204',
        'B': '费用补贴',
        'extends': {
          'row': 99
        }
      },
      {
        'A': '31205',
        'B': '利息补贴',
        'extends': {
          'row': 100
        }
      },
      {
        'A': '31299',
        'B': '其他对企业补助',
        'extends': {
          'row': 101
        }
      },
      {
        'A': '313',
        'B': '对社会保障基金补助',
        'extends': {
          'row': 102
        }
      },
      {
        'A': '31302',
        'B': '对社会保险基金补助',
        'extends': {
          'row': 103
        }
      },
      {
        'A': '31303',
        'B': '补充全国社会保障基金',
        'extends': {
          'row': 104
        }
      },
      {
        'A': '399',
        'B': '其他支出',
        'extends': {
          'row': 105
        }
      },
      {
        'A': '39906',
        'B': '赠与',
        'extends': {
          'row': 106
        }
      },
      {
        'A': '39907',
        'B': '国家赔偿费用支出',
        'extends': {
          'row': 107
        }
      },
      {
        'A': '39908',
        'B': '对民间非营利组织和群众性自治组织补贴',
        'extends': {
          'row': 108
        }
      },
      {
        'A': '39999',
        'B': '其他支出',
        'extends': {
          'row': 109
        }
      }
    ]
  },
  SheetSix: {
    title: 'J06 一般公共预算财政拨款收入支出决算表(财决07表)',
    startRowIndex: 7,
    countConfig: {
      E: ['F', 'G'],
      H: ['H'],
      I: ['I'],
      J: ['J'],
      K: ['K'],
      L: ['L'],
      M: ['M'],
      N: ['N'],
      O: ['O'],
      P: ['P']
    }
  }
}

module.exports = metaData
